---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.RoomFinishBase
source: html/3947e5a5-7901-fd93-2008-6f70f116c79d.htm
---
# Autodesk.Revit.DB.ParameterTypeId.RoomFinishBase Property

"Base Finish"

## Syntax (C#)
```csharp
public static ForgeTypeId RoomFinishBase { get; }
```